SkydiverMCU/mcu-iap-demo/Cortex-M0/MM32F0010/MM32F0010_Application/Application/mm32f0010_it.c
/***********************************************************************************************************************
    @file    mm32f0010_it.c
    @author  FAE Team
    @date    22-Mar-2023
    @brief   THIS FILE PROVIDES ALL THE SYSTEM FUNCTIONS.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/

/* Define to prevent recursive inclusion */
#define _MM32F0010_IT_C_

/* Files include */
#include "platform.h"
#include "uart_interrupt.h"
#include "mm32f0010_it.h"

/**
 * @addtogroup MM32F0010_LibSamples
 * @{
 */

/**
 * @addtogroup UART
 * @{
 */

/**
 * @addtogroup UART_ReceiverIdleFrame_Interrupt
 * @{
 */

/* Private typedef ****************************************************************************************************/

/* Private define *****************************************************************************************************/

/* Private macro ******************************************************************************************************/

/* Private variables **************************************************************************************************/

/* Private functions **************************************************************************************************/

/***********************************************************************************************************************
 * @brief  This function handles NMI exception
 * @note   none
 * @param  none
 * @retval none
 *********************************************************************************************************************/
void NMI_Handler(void)
{
}

/***********************************************************************************************************************
 * @brief  This function handles Hard Fault exception
 * @note   none
 * @param  none
 * @retval none
 *********************************************************************************************************************/
void HardFault_Handler(void)
{
  /* Go to infinite loop when Hard Fault exception occurs */
  while (1)
  {
  }
}

/***********************************************************************************************************************
 * @brief  This function handles SVCall exception
 * @note   none
 * @param  none
 * @retval none
 *********************************************************************************************************************/
void SVC_Handler(void)
{
}

/***********************************************************************************************************************
 * @brief  This function handles PendSVC exception
 * @note   none
 * @param  none
 * @retval none
 *********************************************************************************************************************/
void PendSV_Handler(void)
{
}

/***********************************************************************************************************************
 * @brief  This function handles SysTick Handler
 * @note   none
 * @param  none
 * @retval none
 *********************************************************************************************************************/
void SysTick_Handler(void)
{
  if (0 != PLATFORM_DelayTick)
  {
    PLATFORM_DelayTick--;
  }
}

/***********************************************************************************************************************
  * @brief  This function handles UART1 Handler
  * @note   none
  * @param  none
  * @retval none
  *********************************************************************************************************************/
void UART1_IRQHandler(void)
{
    uint8_t RxData = 0;

    if (SET == UART_GetITStatus(UART1, UART_ISR_RX))
    {
        RxData = UART_ReceiveData(UART1);

        UART_ClearITPendingBit(UART1, UART_ICR_RX);

        if (0 == UART_RxStruct.CompleteFlag)
        {
            UART_RxStruct.Buffer[UART_RxStruct.CurrentCount++] = RxData;

            if (UART_RxStruct.CurrentCount == UART_RxStruct.Length)
            {
                UART_RxStruct.CompleteFlag = 1;

                UART_ITConfig(UART1, UART_ISR_RX, DISABLE);
            }
        }
    }

    if (SET == UART_GetITStatus(UART1, UART_ISR_TX))
    {
        UART_ClearITPendingBit(UART1, UART_ICR_TX);

        if (0 == UART_TxStruct.CompleteFlag)
        {
            UART_SendData(UART1, UART_TxStruct.Buffer[UART_TxStruct.CurrentCount++]);

            if (UART_TxStruct.CurrentCount == UART_TxStruct.Length)
            {
                UART_TxStruct.CompleteFlag = 1;

                UART_ITConfig(UART1, UART_ISR_TX, DISABLE);
            }
        }
    }
}
/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/********************************************** (C) Copyright MindMotion **********************************************/
